W6/D3/first_routes_project/app/controllers/users_controller.rb

  def create
    user = User.new(params.require(:user).permit(:name, :email))

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "pizza"], ["email", "cake@cookie.com"], ["created_at", "2021-10-06 23:35:13.761979"], ["updated_at", "2021-10-06 23:35:13.761979"]]

  def show
    id = params[:id]
    user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "koda@koda.com"], ["updated_at", "2021-10-07 00:05:55.916009"], ["id", 1]]