W6/D5/extra practice/cats_99/app/controllers/cats_controller.rb

  def create
    cat = Cat.new(strong_params)

    if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(strong_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "sex" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "2001-01-02"], ["sex", "M"], ["updated_at", "2021-10-13 06:46:51.020751"], ["id", 9]]

  def destroy # is it possible to make a delete request with an a tag?
    cat = Cat.find_by(id: params[:id])
    cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 10]]