W6/D4/art_share_api/app/controllers/artworkshares_controller.rb

  def create
    shared = ArtworkShare.new(artworkshared_params)

    if shared.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 1]]

  def destroy
    shared = ArtworkShare.find(params[:id])

    shared.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]