W6/D4/art_share_api/app/controllers/artworks_controller.rb

  def index
    if params.has_key?(:user_id)
      artworks = Artwork.where(artist_id: params[:user_id]) +
                ArtworkShare.where(viewer_id: params[:user_id])
    else
      artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 1]]
SELECT "artworks".* FROM "artworks"

  def create
    artwork = Artwork.new(artwork_params)

    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "catter"], ["image_url", "catter.com"], ["artist_id", 1]]

  def show
    id = params[:id]
    artwork = Artwork.find(id)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]