W6/D4/art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"
---
  def index
    if params.has_key?(:user_id)
      comments = Comment.where(user_id: params[:user_id])
    elsif params.has_key?(:artwork_id)
      comments = Comment.where(artwork_id: params[:artwork_id])
    else
      comments = Comment.all

INSERT INTO "comments" ("body", "user_id", "artwork_id") VALUES ($1, $2, $3) RETURNING "id"  [["body", "tester"], ["user_id", 1], ["artwork_id", 3]]
---
  def create
    comment = Comment.new(comment_params)

    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 11]]
---
  def destroy
    comment = Comment.find(params[:id])
    comment.destroy