W6/D4/art_share_api/app/controllers/users_controller.rb

  def index
    if params.has_key?(:username)
      users = User.where("username LIKE '%#{params[:username]}%'")
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%Mike%')
SELECT "users".* FROM "users"

  def show
    id = params[:id]
    user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "koda@koda.com"], ["updated_at", "2021-10-07 00:05:55.916009"], ["id", 1]]