W6/D5/99 cats/cats_99/app/controllers/cats_controller.rb

  def show
    @spec_cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]