W7/D2/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "bo47nVrGKBLQqFGkqR3_nw"], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(session_token: session[:session_token]) # what about multiple users at the same time?