W7/D2/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create # post request: click submit button to create the user in the db
    @user = User.new(strong_user_params)

    if @user.save